import datetime
print("\n")

print(""" 
                                      _________________________________
                                      +                                +
                                      +        "টেলিমেডিসিন সিস্টেম"         +                           
                                      + রোগের ডেটা এনালাইসিস করে রোগ নির্ধারণ  +
                                      + *** ড্যাফোডিল ইন্টারন্যাশনাল ইউনিভার্সিটি **
                                      +       পি.সি-(জি) "ইনোভেটর"        +
                                      +________________________________+
""")
print("Thank You")

print("            (বিঃদ্রঃ সঠিক ভাবে তথ্য গুলো দিন এই তথ্যের ভিত্তিতে আপনার রোগ নির্ধারণ করা হবে এবং ওষুধপত্র দেয়া হবে )  ")
now = datetime.datetime.now()
print("\n")
print("                                  তারিখ       সময়        ")
print(now.strftime("                                %d-%m-%y   %H:%M:%S    "))

print("\n")
while (1):
    name = input("রোগীর নাম ঃ")
    age = int(input("রোগীর বয়স ঃ"))
    gender = input("রোগী মহিলা না পুরুষ ঃ")
    print("---------------------------------------------------------------")
    print("""
        আপনার রোগের নাম এই তালিকা থেকে বেছে নিনঃ
              ১) জ্বর ,সর্দি্‌, কাশি
              ২) চোখ
              ৩) নাক,কান,গলা
              ৪) জন্ডিস

     """)
    choose =input("উপরের তালিকা থেকে এখানে লিখুন(১,২,৩) এভাবে ঃ\n")
    if (choose == '১'):
        print("""
         জ্বর সর্দি কাশি:
         ---------
         """)

        print("দয়াকরে করোনা ভাইরাসের উপসর্গের সাথে আপনার উপসর্গ গুলো মিলেয়ে দেখুন ঃ(থাকলে 'আছে' না থাকলে 'না' লিখুন)")
        temperature = float(input("---->০আপনার শরীরের বতমান তাপমাত্রা কত?(ফারেনহাইটে উল্লেখ করুন)\n"))
        cough = input("------>০ আপনার কি শুষ্ক কাশি আছে ?\n")
        breathache = input("------>০ আপনার কি শ্বাসকষ্ট আছে ?\n")
        muscular = input("------>০ আপনার কি মাংসপেশিতে ব্যথা হয় ?\n")
        NoseOff = input("------>০ আপনার কি নাক বন্ধ জনিত সমস্যা আছে?\n")
        chestpain = input("------>০ আপনার কি বুকে ব্যথা বা চাপ হয়?\n")
        cold= input("------>০ আপনার কি সর্দির জনিত  সমস্যা আছে??\n")


        if (temperature > float('৯৮.৬') and cough == 'আছে' and breathache == 'আছে' and muscular == 'আছে' and chestpain == 'আছে' and cold=='না' and NoseOff=='না'):
            print("আপনার উপসর্গের সাথে করোনা ভাইরাসের উপসর্গের অনেক মিল খুঁজে পাওয়া যাচ্চে  ")
            print(""" 
                       ______________________
                      | এখন আপনাকে যা করতে হবে :
                       ---------------------- 
                        # জন সমাগম এড়িয়ে চলুন ।
                        # হোম কোয়ারেন্টাইন এ থাকুন ।
                        # পর্যাপ্ত পানি পান করুন ।
                        # ২০ সেকেন্ড ধরে সাবান ও পানি দিয়ে হাত পরিষ্কার করুন ।
                         """)

            if age >= 6 and age <= 12:
                print(f"                    << আপনার বয়স যেহেতু {age} >>")
                print("                     << সেহেতু নিচের পরামস গুলো মেনে চলতে পারেন >>")

                print("""
                                                    __________
                                                    |ঔষধ সমূহ :
                                                    ----------
                                                      --> জর থাকলে নাপা ২৫০-৫০০ মি. গ্রা. গ্রাম দিনে ৪ বার খেতে পারেন।
                                                      --> অথবা জ্বর কমাতে দিনে ২৫০-৫০০ মি. গ্রা. পর্যন্ত প্যারাসিটামল দেওয়া যেতে পারে্।""")
                print("""
                                                   ________________
                                                   |ঔষধ সেবনের নিয়ম :
                                                   ----------------
                                                     (১ + ০ + ১) -----> নাপা ০.৫-১গ্রাম ---- চলবে ৭ দিন।
                                                              অথবা
                                                     (১ + ০ + ১) -----> প্যারাসিটামল ৪গ্রাম ---- চলবে ৫ দিন।      
                                                            """)

            elif age > 12 and age < 40:
                print(f"                    << আপনার বয়স যেহেতু {age} >>")
                print("                     << সেহেতু নিচের পরামস গুলো মেনে চলতে পারেন >>")
                print("""
                                    __________
                                    |ঔষধ সমূহ :
                                    ----------
                                      --> জর থাকলে নাপা ০.৫-১ গ্রাম দিনে ৪ বার খেতে পারেন।
                                      --> অথবা জ্বর কমাতে দিনে ৪ গ্রাম পর্যন্ত প্যারাসিটামল দেওয়া যেতে পারে্ন।""")

                print("""
                                   ________________
                                   |ঔষধ সেবনের নিয়ম :
                                   ----------------
                                     (১ + ০ + ১) -----> নাপা ০.৫-১গ্রাম ---- চলবে ৭ দিন।
                                              অথবা
                                     (১ + ০ + ১) -----> প্যারাসিটামল ৪গ্রাম ---- চলবে ৫ দিন।      
                                            """)

            elif age >= 40:
                print(f"                    << আপনার বয়স যেহেতু {age} >>")
                print("                     << সেহেতু নিচের পরামস গুলো মেনে চলতে পারেন >>")
                print("""
                     __________
                     |ঔষধ সমূহ :
                     ----------
                       --> জর থাকলে নাপা ০.৫-১ গ্রাম দিনে ৪ বার খেতে পারেন।
                       --> অথবা জ্বর কমাতে দিনে ৪ গ্রাম পর্যন্ত প্যারাসিটামল দেওয়া যেতে পারে্ন।""")
                print(f'                       --> রোগীর বয়স {age} যেহেতু বয়স ৪০ অথাবা এর উপরে তাই "করোনা ভাইরাসের টিকা দিন অনেক টা্ চিন্তামুক্ত থাকুন"।')
                print("""
                    ________________
                    |ঔষধ সেবনের নিয়ম :
                    ----------------
                      (১ + ০ + ১) -----> নাপা ০.৫-১গ্রাম ---- চলবে ৭ দিন।
                               অথবা
                      (১ + ০ + ১) -----> প্যারাসিটামল ৪গ্রাম ---- চলবে ৫ দিন।      
                             """)
            print("দয়া করে চিকিৎসকের পরামশ নিন")
            print("স্বাস্থ্যবিধি মেনে চলুন")
        elif (temperature > float('৯৮.৬') and NoseOff== 'আছে' and cold== 'আছে' ):
            print(":)ভয়ের কোন কারণ নাই ,করোনা ভাইরাসের উপসর্গ আপনার শরীরে নেই   ")
            print("তবুও দয়া করে চিকিৎসকের পরামশ নিন")

            print(f"                    << আপনার বয়স যেহেতু {age} >>")
            print("                     << জর কমাতে নিচের পরামস গুলো মেনে চলতে পারেন >>")

            print("""
                                                                __________
                                                                |ঔষধ সমূহ :
                                                                ----------
                                                                  --> জর থাকলে নাপা ২৫০-৫০০ মি. গ্রা. গ্রাম দিনে ৪ বার খেতে পারেন।
                                                                  --> অথবা জ্বর কমাতে দিনে ২৫০-৫০০ মি. গ্রা. পর্যন্ত প্যারাসিটামল দেওয়া যেতে পারে্।""")
            print("""
                                                               ________________
                                                               |ঔষধ সেবনের নিয়ম :
                                                               ----------------
                                                                 (১ + ০ + ১) -----> নাপা ০.৫-১গ্রাম ---- চলবে ৭ দিন।
                                                                          অথবা
                                                                 (১ + ০ + ১) -----> প্যারাসিটামল ৪গ্রাম ---- চলবে ৫ দিন।      
                                                                        """)

        else:
            print(":)ভয়ের কোন কারণ নাই ,করোনা ভাইরাসের উপসর্গ আপনার শরীরে নেই   ")
            print("তবুও দয়া করে চিকিৎসকের পরামশ নিন")
            print("স্বাস্থ্যবিধি মেনে চলুন")
            print("বিস্তারিত জানতে ৩৩৩ নাম্বারে ফোন করুন")


    elif (choose == '২'):
        print("""
                        চোখের কোন সমস্যায় আপনি ভুগছেন ,এই তালিকা থেকে বেছে নিনঃ
                        ১) লাল চোখ
                        ২) ফ্যাকাশে চোখ
                        ৩) হলদে চোখ
                        ৪) চোখের ভেতর হলদে
                        ৫) ফোলা চোখ
                        ৬) ছোটবড় চোখের তারা
                        ৭) ঝুলেপড়া চোখ
            """)
        choose1 = input("উপরের তালিকা থেকে এখানে লিখুন(১,২,৩) এভাবে ঃ\n")
        if choose1 == '১':
            print("দয়াকরে আপনার উপসর্গ মিলেয়ে দেখুন ঃ থাকলে 'আছে' না থাকলে 'না' লিখুনঃ  ")
            red = input("------>০ আপনার কি চোখ লাল হয়ে যায়?\n")
            water = input("------>০ আপনার কি চোখে চুলকানি ও অনবরত পানি পড়ে?\n")
            scratch = input("------>০ আপনার কি চোখে খচখচ অনুভব হওয়া ?\n")
            swollen = input("------>০ আপনার চোখ কি মাঝে মাঝে ফুলে যায়?\n")


            if (red == 'আছে' and water == 'আছে' and scratch == 'আছে' and swollen == 'আছে'):
                print("আপনার উপসর্গের সাথে চোখে এলার্জি জনিত উপসর্গের অনেক মিল খুঁজে পাওয়া যাচ্ছে ঃ ")
                print(""" 
                           ______________________
                          | এখন আপনাকে যা করতে হবে :
                           ---------------------- 
                                   # চোখ পাতলা কাপড় দিয়ে পরিষ্কার করতে হবে।  
                                   # চোখে ঘন ঘন হাত দেওয়া যাবে না।
                                   # বাইরে গেলে চোখে যেন ধুলাবালি না যায় তার জন্য চশমা পরতে হবে।
                                   # যে সব খাবারে এলার্জি হয় সেই সকল খাবার কয়েক দিন এড়িয়ে চলতে হবে।
                               """)
                print("""
                                ________________
                               | ঔষধ সেবনের নিয়ম :
                                ----------------
                                # চোখ যদি বেশি চলুকায় তাহলে নিচের ড্রপ টি ব্যাবহার করতে পারেন ঃ
                                --> Ketof i drop (দিনে ৩ থেকে ৪ বার ব্যাবহার করতে পারেন )
                                # এবং এই ঔষধ টি সেবন করে দেখতে পারেনঃ
                                --> Fexo Fast 180 mg (রাতে ১ টা করে)
                                 """)
                print("         তবুও দয়া করে চিকিৎসকের পরামশ নিন")
            else:
                print("আপনার উপসর্গের সাথে চোখে এলার্জি জনিত উপসর্গের মিল খুঁজে পাওয়া যায় নি ")
                print("এখন আপনি চোখের অন্য উপসর্গ গুলো নিচের তালিকা থেকে মিলেয়ে দেখুন  ")
                print("""
                                     এই তালিকা থেকে বেছে নিনঃ
                                     ২) ফ্যাকাশে চোখ
                                     ৩) হলদে চোখ
                                     ৪) চোখের ভেতর হলদে
                                     ৫) ফোলা চোখ
                                     ৬) ছোটবড় চোখের তারা
                                     ৭) ঝুলেপড়া চোখ
                         """)

    elif (choose == '৩'):
        print("""
                        (নাক,কান,গলার) কোন সমস্যায় আপনি ভুগছেন ,এই তালিকা থেকে বেছে নিনঃ
                        ১) সাইনোসাইটিস
                        ২) এজমা
                        ৩) টনসিল

            """)
        choose1 = input("উপরের তালিকা থেকে এখানে লিখুন(১,২,৩) এভাবে ঃ\n")
        if choose1 == '১':
            print("দয়াকরে আপনার উপসর্গ গুলো মিলিয়ে নিনঃ থাকলে 'আছে' না থাকলে 'না' লিখুনঃ  ")
            headaceh = input("---->০ আপনার কি সারাক্ষণ মাথায় অস্বস্তি বোধ হয়?\n")
            sino = input("---->০ আপনার কি নাক বন্ধ থাকা, নাক দিয়ে সর্দি জনিত সমস্য গুলো আছে?\n")
            eye = input("---->০ আপনার কি চোখ চুলকানো, চোখ দিয়ে পানি পড়া, মাথা ধরা, ব্যথা করা এ জনিত সমস্য গুলো আছে ?\n")

            if (headaceh == 'আছে' and sino == 'আছে' and eye == 'আছে'):
                print("আপনার উপসর্গের সাথে সাইনোসাইটিস উপসর্গের মিল রয়েছে  ")
                print(""" এখন আপনাকে যা করতে হবেঃ
                                   # ঠান্ডা খাবার পরিহার করুন
                                   # রাস্তাঘাটে চলাফেরার সময় এমনকি কর্ম ক্ষেত্রে যদি ধুলাবালির প্রকোপ থাকে, 
                                   সে ক্ষেত্রে সাধারণ মাস্ক নয়, সার্জিক্যাল মাস্ক ব্যবহার করবেন।
                                   # বাড়িতে লোমশ গৃহপালিত জীব-জন্তু পোষা থেকে বিরত থাকুন ।
                                   #সূতি কাপড় ব্যবহার করতে হবে। কার্পেট ব্যবহার করা যাবে না।
                               """)
            else:
                print("""
                        :)ভয়ের কোন কারণ নাই ,সাইনোসাইটিস এর লক্ষণ আপনার শরীরে নেই ।
                        তবুও দয়া করে চিকিৎসকের পরামশ নিন ।
                        স্বাস্থ্যবিধি মেনে চলুন ।


                """)
    if (choose == '৪'):
        print("জন্ডিস উপসর্গের সাথে আপনার উপসর্গের মিলেয়ে নিনঃ")

        eyecolor = input(
            "---->০ আপনার কি চোখ ও প্রসাবের রং হলুদ হয়ে যায় আবার সমস্যা বেশি হলে পুরো শরীর গাঢ় হলুদবর্ণ হওয়া এ জনিত সমস্য গুলো আছে? ?\n")
        weakhelth = input("---->০ আপনার কি ক্ষুধামন্দা,শারীরিক দুর্বলতা,বমি বমি ভাব অথবা বমি এ জনিত সমস্য গুলো আছে?\n")

        if (eyecolor == 'আছে' and weakhelth == 'আছে'):
            print("আপনার উপসর্গের সাথে জন্ডিস উপসর্গের মিল রয়েছে  ")
        print(""" এখন আপনাকে যা করতে হবেঃ
                                       # ভাইরাল হেপাটাইটিসের ক্ষেত্রে পর্যাপ্ত বিশ্রাম নেয়া চিকিৎসার জন্য অত্যন্ত গুরুত্বপূর্ণ ।
                                       সে ক্ষেত্রে সাধারণ মাস্ক নয়, সার্জিক্যাল মাস্ক ব্যবহার করবেন ।
                                       # বাড়িতে লোমশ গৃহপালিত জীব-জন্তু পোষা থেকে বিরত থাকুন ।
                                       #সূতি কাপড় ব্যবহার করতে হবে। কার্পেট ব্যবহার করা যাবে না।
                          """)
    print("\n")
    choose = input("আপনি কি আরও সেবা নিতে চান ?")
    print("\n")
    if choose == 'না':
        break
